{
  "posts": [
    {
      "title": "First Blog Post",
      "date": "12-15-2018",
      "author": "Aaron",
      "body": [
        {
          "type": "text",
          "text": "I'm adding a blog to my website. I don't have much to say right now but I might in the future."
        }
      ]
    },
    {
      "title": "Adding Images to Blog Posts",
      "date": "12-22-2018",
      "author": "Aaron",
      "body": [
        {
          "type": "text",
          "text": "Here's a embedded image. Json is pretty neat, I suppose. All the blog posts are just stored in a json file. Anyways, I like this wallpaper by WLOP."
        },
        {
          "type": "image",
          "src": "/images/blog/sunset.jpg",
          "style": {
            "max-width": "75%",
            "max-height": "75%",
            "padding-bottom": "1em"
          }
        },
        {
          "type": "text",
          "text": "I just have to add another text field, and voila, more text."
        }
      ]
    },
    {
      "title": "Winter Break and Projects",
      "date": "12-23-2018",
      "author": "Aaron",
      "body": [
        {
          "type": "text",
          "text": "Winter break is now in full swing for us UMN students. I don't have a job, so all of a sudden I basically have no deadlines to be meeting. This website is basically the only project I have to work on right now. Maybe I will mess around with my STM32F4 dev board some more, I started porting over my high school AES library code to it a while ago."
        },
        {
          "type": "text",
          "text": "As far as the future of this website is concerned, I think this JS/React project I have going works well and can be maintained. This is the third iteration of the website, and the second actual server, but I have had the same domain for a while (maybe I could eventually shell out some money for aaroncook.io or aaroncook.com and just route this domain to the fancier one). I eventually want this website to feel like it's complete, not just a single portfolio or a page of my art project. I think this blog adds some variety. Maybe I will try to incorporate some outside services, like a method of commenting or embedding of GitHub content etc. But for now there's still basic things this blog could probably use which I haven't thought of."
        },
        {
          "type": "text",
          "text": "Now that I am thinking about it, I want to revive my final project from Intro to Digital Drawing, two pages to an animated webcomic. I think a page indexing that project and now my Zines, Comics, and Books final could be pretty neat. I'll have to rip that old HTML from the now dead Apache server, luckily it is on the same VPS so it's not deleted. I'm taking Intermediate Digital Drawing in Spring 2019, so I'll probably have some more web-based projects to upload."
        }
      ]
    },
    {
      "title": "New Domain, Github Pages, and Circle CI",
      "date": "01-13-2019",
      "author": "Aaron",
      "body": [
        {
          "type": "text",
          "text": "Many changes have occurred within the past week or so. The website has a new official domain! I  got aarongc.com from Google for a relatively decent price. I still own aaroncook.xyz, and I might keep it around just so someone else doesn't buy it."
        },
        {
          "type": "image",
          "src": "/images/blog/github-logo-1.png",
          "style": {
            "max-width": "15%",
            "max-height": "15%",
            "padding-bottom": "1em"
          }
        },
        {
          "type": "embed_html",
          "html": "<p>I also was able to cancel my VPS (Woot Hosting, they were trash by the way) in favor of just using <a href='https://pages.github.com/'>Github Pages</a>. I was only using the server to host this site anyways, so paying for a full root access box just didn't make sense any more.</p>"
        },
        {
          "type": "image",
          "src": "/images/blog/logo-circleci.png",
          "style": {
            "max-width": "20%",
            "max-height": "20%"
          }
        },
        {
          "type": "embed_html",
          "html": "<p>I've also got <a href='https://circleci.com'>Circle CI</a> setup to automatically deploy any new commits pushed to master on GitHub. Thus, updating the website is as simple as pushing a new commit from my PC. I'm very happy with the progress I have made so far with the state of this website. There are still a few issues I want to address though. The individual gallery slideshows are broken, and I need to reassemble my final project from Introduction to Digital Drawing.</p>"
        }
      ]
    },
    {
      "title": "Site Bug Fixes",
      "date": "01-15-2019",
      "author": "Aaron",
      "body": [
        {
          "type": "text",
          "text": "I have been making small updates to the site lately. GitHub pages had issues routing brand new pages that aren't the index page. I used a common 404 error rerouting trick to fix it. I also fixed the issues the individual gallery slideshows had when trying to navigate. Oh, and I updated the site favicon (the image on the browser tab):"
        },
        {
          "type": "image",
          "src": "/favicon.ico"
        }
      ]
    }
  ]
}